Revit 2027 API
ElectricalSystem.HasPathOffset Property
 Whether the circuit path has a valid offset.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool HasPathOffset { get; }
Public ReadOnly Property HasPathOffset As Boolean
	Get
public:
property bool HasPathOffset {
	bool get ();
}
member HasPathOffset : bool with get
Property Value
Boolean
Remarks
 Circuit path of AllDevices and Custom mode may not have valid offset if the horizontal segments of the path are not at the same height.
See Also
Reference
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace